





pol_relevant_quests={
    'Лучшая политическая система для России':['j107'],
    'Одобрение Путина':['j110'] ,
    'Приходится ли давать взятки?':['j112'],
    'Правовой нигилизм':['j114','j115'],
    'Социальная прогрессивность': ['j121.1','j121.2','j121.3','j121.4','j121.5',],
    'Либеральные ценности':['j208'],
    'Как стать миллионером?': ['j211.01','j211.02','j211.03','j211.04','j211.05','j211.06','j211.07'],
    'Почему бедные - бедные?':['j212'],
    'Что в нашем обществе сегодня люди уважают больше всего?':['j213'],
    'Как победить неравенство?' :['j214'],
    'Рынок или государство предоставляют общ. блага?':['j220'],
    'Рынок или государство':['j221','j69.5'],
    'Авторитарность':['j410'],
    'Ксенофобия':['j69.3.a','j69.3.b'],
    'Отношение к цензуре':['j128'],
    'Доверие институтам':['j207'],
    'Государственная религия':['j127','j128.1','j128.2','j128.3','j128.4'],
    'Сексизм':['j69.6','j69.6.1','j69.6.2','j69.6.3','119.1','j119.2','j119.3','j120','j6964.1','j6964.2','j6964.3',
          'j6964.4','j6964.5','j6964.6','j6964.7','j6964.8','j6964.9','j696410','j696411','j696412','j696413'],
    'Поддвергались ли вы грабежу последние 5 лет?':['j332'],
    'Кто может вывести Россию из кризиса?':['j102.1','j102.2','j102.3','j102.4','j102.5','j102.6','j102.7','j102.8','j102.9'],
    'Самооценка соц.статуса':['j62','j63','j64'],
    'Самоидентификация с соц. группой':['j118.1','j118.2','j118.3','j118.4','j118.5','j118.6','j118.7','j118.8'],
    'Близость с соц. группой':['j193.1','j193.2','j193.3','j193.4','j193.5','j193.6','j193.7','j193.8','j193.9','j193.10'],
    'Налоги':['j99.1','j99.2','j99.3','j100','j101.1','j101.2','j101.3','j101.4','j101.5'],
    'Восприятие коррупции':['j112','j113','j209.5'],
    'Полит. участие':['j137','j138','139.1','139.2','139.3','139.4','139.5','139.6','143.1','j143.2','j143.3']
}